{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "items",
      "patterns": [
        "Which items do you have?",
        "What kinds of items are there?",
        "What do you sell?"
      ],
      "responses": [
        "We sell coffee and tea",
        "We have coffee and tea"
      ]
    },
    {
      "tag": "payments",
      "patterns": [
        "Do you take credit cards?",
        "Do you accept Mastercard?",
        "Can I pay with Paypal?",
        "Are you cash only?"
      ],
      "responses": [
        "We accept VISA, Mastercard and Paypal",
        "We accept most major credit cards, and Paypal"
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
        "How long does delivery take?",
        "How long does shipping take?",
        "When do I get my delivery?"
      ],
      "responses": [
        "Delivery takes 2-4 days",
        "Shipping takes 2-4 days"
      ]
    },

    {
      "tag": "funny",
      "patterns": [
        "Tell me a joke!",
        "Tell me something funny!",
        "Do you know a joke?"
      ],
      "responses": [
        "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
        "What did the buffalo say when his son left for college? Bison."
      ]
    },
    {
      "tag": "self-questions",
      "patterns": [
        "   ",
        "    مرحبا  ",
        "  كيف حالك  ",
         "  من انت    ",
         "   اخبرني عنك  ",
         "  كيف حالك  "
      ],
      "responses": [
          " اهلا بك ي صديقي انا روبوت دردشة استطيع ان اجيب على استفسارات هل لديك سؤال ؟ ",

        " انا روبوت ذكاء  اصطناعي  تم تطويري لخدمة العملاء يسعدني تواصلك معي هل لديك سؤال اخر ؟ ",

        " انا روبوت ذكاء  اصطناعي اعمل في خدمة العملاء الخاص برئاسة هيئة ولايه نهر النيل هل لديك سؤال ؟ ",
        "   مرحبا بك ي عزيزي اود اخبارك انني روبوت دردشة اقوم بالاجابه على استفساراتك يمكنني ايضا تقديم حلول لمشاكلك "
      ]
    },

        {
      "tag":"permit",
      "patterns": [

          " مستلزمات تصريح تركيب خط مياه "

      ],
      "responses": [

          "الشركات المحلية للمياه: في السودان، تقوم كل ولاية أو مدينة بتقديم خدمات المياه من خلال شركات محلية أو هيئات حكومية. يجب على الشخص الراغب في توصيل خط مياه جديد تقديم طلب إلى شركة المياه أو الهيئة العامة للمياه في منطقته. نموذج طلب: يجب ملء النموذج الخاص بطلب توصيل خط مياه جديد. قد يكون هناك نموذج محدد متاح في مكاتب الهيئة أو الشركة.\nصورة من الهوية الوطنية: لإثبات الهوية، يجب تقديم نسخة من الهوية الوطنية أو جواز السفر.\nملكية الأرض أو العقار: يجب تقديم شهادة ملكية للعقار الذي سيتم توصيل المياه إليه، أو عقد إيجار موثق.\nخريطة الموقع: قد يطلب منك تقديم خريطة الموقع أو رسم بياني يوضح مكان العقار ضمن شبكة المياه.\nبيانات الاتصال: يجب أن تتضمن الطلب رقم الهاتف و عنوان الإقامة لتسهيل عملية التواصل.3. إجراء فحص ميداني:\nزيارة ميدانية: بعد تقديم الطلب، قد يتم إرسال فريق فني من الشركة أو الهيئة المختصة للقيام بزيارة ميدانية للموقع. الهدف من الزيارة هو:\nالتأكد من موقع العقار.\nفحص البنية التحتية المتوفرة في المنطقة (مثل قرب العقار من الشبكة الرئيسية للمياه).\nتقييم إمكانية توصيل خط المياه بشكل آمن وفعال. 4. الموافقة على التوصيل:\nدراسة الطلب: بناءً على الفحص الميداني والمستندات المقدمة، تقوم الهيئة المعنية بدراسة إمكانية توصيل المياه.\nإصدار التصريح: في حال تم الموافقة على التوصيل، ستصدر الهيئة أو الشركة تصريحًا رسميًا يتيح لك البدء في توصيل خط المياه الجديد. 5. الرسوم والتكاليف:\nقد يتم فرض رسوم إدارية للحصول على التصريح أو رسوم توصيل يتم دفعها مقابل تكلفة تركيب الأنابيب وتوصيل المياه إلى العقار.\nالرسوم تتفاوت حسب المنطقة ونوع الخدمة المطلوبة (منزلية أو تجارية). 6. تنفيذ العمل الفني:\nبعد الحصول على التصريح، يتم البدء في تنفيذ الأعمال الفنية لتوصيل خط المياه الجديد.\nعادةً ما يتم تركيب الأنابيب باستخدام المواد المعتمدة مثل أنابيب PVC أو بولي إيثيلين، ويتم توصيلها إلى الشبكة الرئيسية.\nفي بعض الحالات، قد يتطلب العمل استكمال تركيب عداد مياه لقياس استهلاك المياه.\n7. الاختبارات والتفتيش:\nبعد تركيب الأنابيب، يتم إجراء اختبارات لضمان عدم وجود تسريبات في الأنابيب.\nقد يقوم الفنيون بإجراء اختبار ضغط للتأكد من أن التوصيل آمن ويعمل بشكل سليم.  "


      ]

    },

        {
      "tag":"about-comp",
      "patterns": [

          " اريد معلومات عن طريقة توصيل خط مياه جديد الي منزلي ",
          " اود معرفة متطلبات توصيل خط مياه جديد الي منزلي  ",
          "   ما هي متطلبات توصيل خط مياه جديده ",
          " متطلبات توصيل خط مياه جديده ",
          " خطوات توصيل خط مياه جديد "
      ],
      "responses": [
          " اولا : زيارة رئاسة الهيئة للحصول علي التصريح . ثانيا:التأكد من وجود شبكة مياه قريبة . ثالثا: الفحص الهندسي للموقع. رابعا:معرفة تكاليف التوصيل . خامسا :اختيار الأنابيب والمعدات المناسبة. سادسا : التخطيط للموقع والتركيب الفني ثم اختبار النظام .التسجيل والتوثيق :سابعا اتباع التعليمات الخاصة باستخدام المياه "


      ]

    },

        {
      "tag":"documents",
      "patterns": [

          "  المستندات المطلوبة لنيل :التصريح ",
          " المستندات المطلوبة للحصول على تصريح لتركيب خط مياه جديد",
        "التصريح"
      ],
      "responses": [
          " اولا : زيارة رئاسة الهيئة للحصول علي التصريح . ثانيا:التأكد من وجود شبكة مياه قريبة . ثالثا: الفحص الهندسي للموقع. رابعا:معرفة تكاليف التوصيل . خامسا :اختيار الأنابيب والمعدات المناسبة. سادسا : التخطيط للموقع والتركيب الفني ثم اختبار النظام .التسجيل والتوثيق :سابعا اتباع التعليمات الخاصة باستخدام المياه "

      ]

    },

        {
      "tag":"permitGiven",
      "patterns": [

          " كيف احصل علي تصريح  لتوصيل خط مياه الي منزلي ",
          "    التصريح",
        "تصريح توصيل خط مياه",
        "تصريح خط المياه"
      ],
      "responses": [
          " الحصول على تصريح لتوصيل خط مياه جديد في السودان يتطلب تقديم طلب رسمي إلى الهيئة المعنية، بالإضافة إلى فحص ميداني للموقع ودفع الرسوم المطلوبة. يجب توفير المستندات اللازمة، مثل شهادة الملكية وخريطة الموقع. بعد الموافقة، يمكن تنفيذ العمل الفني وتوصيل المياه إلى العقار، مع ضمان إجراء الاختبارات اللازمة للتأكد من سلامة النظام. "

      ]

    },
     {
      "tag":"bills",
      "patterns": [

          "     اريد تسديد فاتورة   ",
          "  كيف يمكنني سداد فاتورة ",
        " سداد فاتورة",
        " كيف يمكنني دفع فاتورة المياه",
        "  دفع فاتورة المياه",
        " هل يمكنني دفع فواتير المياه عبر الهاتف المحمول ",
        "  هل يمكنني سداد فاتورة المياه عبر الإنترنت ",
        " ",
        ""
      ],
      "responses": [
          " . الدفع عبر الإنترنت: يمكن للمواطنين دفع فواتير المياه عبر الإنترنت من خلال البنوك أو المحفظات الإلكترونية مثل \"زين كاش\" و\"موبايلي كاش\". يمكنك زيارة الرئاسة او اقرب فرع "


      ]

    },
     {
      "tag":"spill",
      "patterns": [

          "    لدي مشكلة تسريبات في الأنابيب    ",
          "  ما هو حل مشكلة التسريب في الانبوب      ",
        " ما هي الأسباب الشائعة لتسرب المياه والحل",
        "  كيف يمكنني إصلاح تسرب الأنابيب؟ ",
        " "
      ],
      "responses": [
          "  تسريبات في الأنابيب قد تحدث بسبب الصدأ الحل هو فحص الانابيب الداخليه والتاكد من سلامتها .هل تريد نصائح للوقاية ؟ "

      ]

    },
     {
      "tag":"pressure",
      "patterns": [
        "هل هناك حلول دائمة لمشكلة انخفاض ضغط المياه",
        " كيف يمكنني التحقق من مستوى الضغط في شبكة المياه؟",
        " هل تؤثر فلاتر المياه على ضغط المياه؟",
           " كيف يمكنني زيادة ضغط المياه في المنزل؟",
          " ضغط المياه منخفض",
          "  ما هو حل مشكلة  انخفاض ضغط المياه       "


      ],
      "responses": [

        " فحص فلتر المياه والأنابيب الداخلية، قد تحتاج لتثبيت مضخة لزيادة الضغط . هل تريد نصائح للوقاية ؟ "

      ]

    },
    {
      "tag":"smell",
      "patterns": [
        "  هل يؤدي تلوث المياه إلى تغير رائحة المياه؟",
           " ما هي الأسباب الرئيسية لتغير رائحة المياه؟",
          " رائحة المياه متغيره  ",
          "  ما هو  سبب تغير رائحة المياه       "


      ],
      "responses": [

        "  تنظيف الأنابيب، أو استخدام فلاتر مياه منزلية لتحسين جودة المياه. . هل تريد نصائح للوقاية ؟"

      ]

    },
     {
      "tag":"tap",
      "patterns": [

          "  مشكلة في صنبور المياه  ",
         "  مشكلة في الحنفية   ",
         "   الحنفية   ",
          " حل مشكلة  حنفية المياه      "


      ],
      "responses": [

        "  يمكن أن يكون بسبب تلف في رأس الصنبور(حنفية) أو انسداد في الفلاتر الحل استبدال رأس الصنبور أو تنظيف . الفلاتر هل تريد نصائح للوقاية ؟ .   "

      ]

    },
     {
      "tag":"prevent",
      "patterns": [

          "  نصائح للوقاية  ",
         "  الوقاية    ",
          "    ما هي طرق الوقايه من كل هذه الاضرار    "


      ],
      "responses": [

        "  إجراء فحوصات دورية لنظام المياه بالمنزل. استخدام الفلاتر لتنقية المياه- -التأكد من صيانة سخانات المياه بشكل منتظم-  -تجنب إلقاء المواد التي قد تتسبب في انسداد الأنابيب مثل الزيوت أو الشعر.-   "

      ]

    },
     {
      "tag":"techTeam",
      "patterns": [

          "  ما هي طريقة التركيب   ",

          "     تركيب الانابيب   ",
          "   كيف يمكنني ضمان تركيب الانابيب بنجاح    "


      ],
      "responses": [

        " اولا: يجب الحصول على التصاريح الرسمية من الهيئات المعنية . ثانيا: اختيار الأنابيب المناسبة . ثالثا: حفر الأنابيب وتمديدها . رايعا :التأكد من عدم وجود تسريبات . خامسا: إغلاق الحفر وإعادة تأهيل الموقع: . سادسا :يتم فتح الصمامات الخاصة بالخط وتوصيل المياه إلى النظام للتأكد من تدفق المياه بشكل طبيعي إلى المكان . سابعا: الصيانة الدورية   "

      ]

    },
     {
      "tag":"tools",
      "patterns": [

          "  ما هي  المعدات الأساسية  المستخدمة في التركيب   ",

          "   ادوات تركيب الانابيب     ",
          "   المعدات الأساسية المستخدمة في التركيب    "


      ],
      "responses": [

        " أنابيب PVC أو بولي إيثيلين (لأنظمة مياه الشرب أو الري). صمامات للتحكم في تدفق المياه. ملحقات وصل الأنابيب مثل الوصلات والأقواس والمفاصل. معدات الحفر (مثل الحفارات الصغيرة أو اليدوية). معدات اختبار الضغط لضمان عدم وجود تسريبات.   "

      ]

    },

     {
      "tag":"notes",
      "patterns": [

          " كيف اضمن استقرار الخط   ",

          "  استقرار الماء  ",
          "   كيف يمكنني ضمان استقرار تدفق المياه     ",
        " كيف يمكنني المحافظه على عدم انقطاع المياه"


      ],
      "responses": [

        "   يجب استخدام مواد ذات جودة عالية لتحمل الظروف المناخية القاسية في السودان.\nالاستعانة بمهندسين وفنيين معتمدين لتنفيذ العمل بشكل صحيح.\nفي حالة وجود صعوبات في الوصول إلى الشبكة الرئيسية، يمكن اللجوء إلى استخدام الخزانات أو إنشاء نظام مياه خاص (مثل حفر الآبار) إذا كانت المنطقة نائية.   "

      ]

    }

  ]
}

